package day4;

// class Animal {
//	String name;
//}

public class Sample2 {

	public static void main(String[] args) {
		//	Animal cat = new Animal();
			
		// Animail 이라는 껍데기 클래스를 조금 더 발전시켜보자. 
		// Animail 클래스에 의해 만들어진 동물에 이름을 지어보자
		
		// Animal 클래스에 name 이라는 String 변수를 추가했다.
		// 이렇게 클래스에 선언된 변수를 객체변수라고 한다. 
		// 객체 변수는 인스턴스 변수, 멤버 변수, 속성이라고도 한다
		
		// 클래스에 의해 생성되는것은 객체
		// 그 클래스에 선언된 변수는 객체변수라고 생각하면 쉽다
		
		// 객체 변수를 만들었으니 이제 객체 변수를 사용해 보자
		// 먼저 객체 변수는 변수이므로 값을 대입할수 있을거시다.
		// 대입하기 전에 객체 변수는 현재 어떤값을 가지고 있는지 먼저 출력해보자
		// 객체 변수를 출력하려면 객체 변수에 어떻게 접근해야 하는지를 먼저 알아야 한다.
		// 객체 변수는 다음과같이 도트연산자(.)를 이용해 접근할수있따.
		// 객체.객체변수
		// cat.name 	객체 : cat, 객체변수 : name
		
		// 출력
		//	System.out.println(cat.name);  // null 출력
		// null 값은 값이 할당되어 있지 않은 상태를 말한다.
		// 객체 변수로 name을 선언했지만 아무런 값도 대입을 하지 않았기 때문에 null이라는 값이 출력된것이다.
			
		
		
	}

}
